## statements in python

In [ ]:
x = 'abc'
print('hello world',
     x)

In [ ]:
x=11
if x>10 and \
    x<13:
    print(x)

In [ ]:
x =10
x

In [ ]:
id(x)

In [ ]:
y = 10
y

In [ ]:
id(y)

In [ ]:
x =15
x

In [ ]:
id(x)

In [ ]:
hex(id(x))

In [ ]:
2+5

In [ ]:
5-7

In [ ]:
5*7

In [ ]:
16/4

In [ ]:
13//4,13%4

In [ ]:
-13//4,-13%4

In [ ]:
13//-4,13%-4

In [ ]:
-13//-4,-13%-4

In [ ]:
a=3*1.1
b=3.3

In [ ]:
a==b

In [ ]:
3*1.1

In [ ]:
import math

In [ ]:
math.isclose(a,b)

In [ ]:
False and True or True

In [ ]:
False or True and False

In [ ]:
False and (True or False)

In [ ]:
not False

In [ ]:
not True

## Data structures

In [ ]:
list1 = [1,2,3,4,5]
list1

In [ ]:
type(list1)

In [ ]:
tup1 = (10,20,30,40,50)
tup1

In [ ]:
type(tup1)

In [ ]:
str1 = 'hello world'
str1

In [ ]:
type(str1)

In [ ]:
list1

In [ ]:
list1[3]

In [ ]:
tup1

In [ ]:
tup1[4]

In [ ]:
tup1[-1]

## Slicing

In [ ]:
str1

In [ ]:
str1[1:3]

In [ ]:
str1[0:5]

In [ ]:
list1

In [ ]:
list1[2:]

In [ ]:
list1[:4]

In [ ]:
list1[:]

In [ ]:
list1[1:4:2]

In [ ]:
list1[::-1]

In [ ]:
str="Welcome"
str

In [ ]:
str[::-1]

In [ ]:
list(enumerate(str1))

# Practice

In [5]:
num = eval(input("Enter a Number: "))
sum = 0
if num!=0:
    for i in range(1, num+1):
        sum += i
        print(sum)

Enter a Number: 5
1
3
6
10
15

In [7]:
Sum = 0

print("Please Enter 10 Numbers\n")
for i in range(1, 11):
    num = int(input("Number %d = " %i))
    Sum = Sum + num

avg = Sum / 10

print("The Sum of 10 Numbers     = ", Sum)
print("The Average of 10 Numbers = ", avg)

Please Enter 10 Numbers

Number 1 = 1
Number 2 = 2
Number 3 = 3
Number 4 = 4
Number 5 = 5
Number 6 = 6
Number 7 = 7
Number 8 = 8
Number 9 = 9
Number 10 = 10
The Sum of 10 Numbers     =  55
The Average of 10 Numbers =  5.5

In [49]:
import numpy as np
import pandas as pd
data= np.random.randn(4,3)
df = pd.DataFrame(data, ['A', 'B', 'C', 'D'], ['E','F', 'G'])

In [50]:
df

          E         F         G
A -0.021322 -0.672896 -0.041945
B -0.606008 -1.224186  0.404325
C -0.403170 -2.821399 -1.415196
D -0.858924  0.092839  0.541125

In [51]:
df['E+G'] = df['E']+df['G']
df['E+G']

A   -0.063267
B   -0.201683
C   -1.818366
D   -0.317799
Name: E+G, dtype: float64

In [52]:
rows = ['1','2','3','4','5']
cols = ['Name', 'Age','Weight', 'Score']

In [55]:
df = pd.DataFrame(np.random.randn(5,4), rows, cols)
df

       Name       Age    Weight     Score
1 -0.338378  1.133696  0.264201  0.396628
2  0.399684 -0.319869  0.050488 -2.752388
3  0.632429  0.221565 -0.808770 -2.557986
4 -0.098824  0.348953 -0.778227 -0.019648
5 -0.132529 -0.364356 -1.104337  0.764720

In [58]:
df1 = pd.DataFrame(np.round(np.random.randn(5,4),2), rows, cols)
df1

   Name   Age  Weight  Score
1 -0.23  0.45    0.43   1.54
2 -0.52  0.22    1.15  -0.68
3 -1.38 -0.17   -0.52  -0.82
4 -0.84  1.71    0.31   0.58
5  1.56  0.57   -0.19   0.60

In [59]:
df1['N+A'] = df1['Name']+df1['Age']
df1['N+A']

1    0.22
2   -0.30
3   -1.55
4    0.87
5    2.13
Name: N+A, dtype: float64

In [60]:
df1

   Name   Age  Weight  Score   N+A
1 -0.23  0.45    0.43   1.54  0.22
2 -0.52  0.22    1.15  -0.68 -0.30
3 -1.38 -0.17   -0.52  -0.82 -1.55
4 -0.84  1.71    0.31   0.58  0.87
5  1.56  0.57   -0.19   0.60  2.13

In [63]:
df1.drop('Name', axis = 1)

    Age  Weight  Score   N+A
1  0.45    0.43   1.54  0.22
2  0.22    1.15  -0.68 -0.30
3 -0.17   -0.52  -0.82 -1.55
4  1.71    0.31   0.58  0.87
5  0.57   -0.19   0.60  2.13

In [64]:
df1.iloc[:,0:4]    # Index Location

   Name   Age  Weight  Score
1 -0.23  0.45    0.43   1.54
2 -0.52  0.22    1.15  -0.68
3 -1.38 -0.17   -0.52  -0.82
4 -0.84  1.71    0.31   0.58
5  1.56  0.57   -0.19   0.60

In [70]:
df1.iloc[2:,:]

   Name   Age  Weight  Score   N+A
3 -1.38 -0.17   -0.52  -0.82 -1.55
4 -0.84  1.71    0.31   0.58  0.87
5  1.56  0.57   -0.19   0.60  2.13

In [80]:
df1.loc[:,'Name']

1   -0.23
2   -0.52
3   -1.38
4   -0.84
5    1.56
Name: Name, dtype: float64

In [84]:
df[df['Name']>0.5]

       Name       Age   Weight     Score
3  0.632429  0.221565 -0.80877 -2.557986

In [87]:
df[df['Weight']<0.1]

       Name       Age    Weight     Score
2  0.399684 -0.319869  0.050488 -2.752388
3  0.632429  0.221565 -0.808770 -2.557986
4 -0.098824  0.348953 -0.778227 -0.019648
5 -0.132529 -0.364356 -1.104337  0.764720

In [90]:
df[df['Weight']<0.1].reset_index()

  index      Name       Age    Weight     Score
0     2  0.399684 -0.319869  0.050488 -2.752388
1     3  0.632429  0.221565 -0.808770 -2.557986
2     4 -0.098824  0.348953 -0.778227 -0.019648
3     5 -0.132529 -0.364356 -1.104337  0.764720

In [91]:
df[df['Weight']<0.1].reset_index(drop=True)

       Name       Age    Weight     Score
0  0.399684 -0.319869  0.050488 -2.752388
1  0.632429  0.221565 -0.808770 -2.557986
2 -0.098824  0.348953 -0.778227 -0.019648
3 -0.132529 -0.364356 -1.104337  0.764720